backend/TransactionSign.Tests/LoadTests/results/20260415-003039/k6-output.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\Davit Gabrielyan\source\repos\TransactionSign\backend\TransactionSign.Tests\LoadTests\k6-workflow.js
        output: -

     scenarios: (100.00%) 2 scenarios, 31 max VUs, 30m5s max duration (incl. graceful stop):
              * monitor: 1 looping VUs for 30m0s (exec: monitorCompletion)
              * signers: 30 looping VUs for 30m0s (exec: signerFlow, gracefulStop: 5s)


running (00m01.0s), 31/31 VUs, 0 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m01.0s/30m0s
signers   [   0% ] 30 VUs  00m01.0s/30m0s

running (00m02.0s), 31/31 VUs, 30 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m02.0s/30m0s
signers   [   0% ] 30 VUs  00m02.0s/30m0s
time="2026-04-15T00:30:41+04:00" level=info msg="{\"level\":\"info\",\"action\":\"complete\",\"message\":\"All transactions signed\",\"ts\":\"2026-04-14T20:30:41.720Z\"}" source=console

running (00m03.0s), 31/31 VUs, 74 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m03.0s/30m0s
signers   [   0% ] 30 VUs  00m03.0s/30m0s

running (00m04.0s), 31/31 VUs, 112 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m04.0s/30m0s
signers   [   0% ] 30 VUs  00m04.0s/30m0s

running (00m05.0s), 31/31 VUs, 147 complete and 0 interrupted iterations
monitor   [   0% ] 1 VUs   00m05.0s/30m0s
signers   [   0% ] 30 VUs  00m05.0s/30m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 230     42.851576/s
    checks_succeeded...: 100.00% 230 out of 230
    checks_failed......: 0.00%   0 out of 230

    ✓ pending 200

    HTTP
    http_req_duration..............: avg=83.33ms  min=1.98ms   med=5.28ms   max=776.18ms p(90)=470.97ms p(95)=615.83ms
      { expected_response:true }...: avg=83.33ms  min=1.98ms   med=5.28ms   max=776.18ms p(90)=470.97ms p(95)=615.83ms
    http_req_failed................: 0.00% 0 out of 230
    http_reqs......................: 230   42.851576/s

    EXECUTION
    iteration_duration.............: avg=953.91ms min=606.69ms med=867.64ms max=5.36s    p(90)=1.4s     p(95)=1.4s    
    iterations.....................: 159   29.623481/s
    vus............................: 31    min=31       max=31
    vus_max........................: 31    min=31       max=31

    NETWORK
    data_received..................: 37 kB 6.9 kB/s
    data_sent......................: 25 kB 4.7 kB/s



running (00m05.4s), 00/31 VUs, 158 complete and 986 interrupted iterations
monitor ✗ [   0% ] 1 VUs   00m05.4s/30m0s
signers ✗ [   0% ] 30 VUs  00m05.4s/30m0s
time="2026-04-15T00:30:45+04:00" level=error msg="test aborted: All transactions signed - test complete at monitorCompletion (file:///C:/Users/Davit%20Gabrielyan/source/repos/TransactionSign/backend/TransactionSign.Tests/LoadTests/k6-workflow.js:177:24(88))"